Revit 2024 API
StructuralMaterialTypeFilter Constructor (StructuralMaterialType, Boolean)
 Constructs a new instance of a filter to match family instances by structural material type, with the option to match all families which are not of the given structural material type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public StructuralMaterialTypeFilter(
	StructuralMaterialType structuralMaterialType,
	bool inverted
)
Visual Basic
Public Sub New ( _
	structuralMaterialType As StructuralMaterialType, _
	inverted As Boolean _
)
Visual C++
public:
StructuralMaterialTypeFilter(
	StructuralMaterialType structuralMaterialType,
	bool inverted
)
Parameters
structuralMaterialType
Type: Autodesk.Revit.DB.Structure.StructuralMaterialType
 The structural material type to match.
inverted
Type: System.Boolean
 True if the filter should match all family instances which are not of the given structural material type.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
StructuralMaterialTypeFilter Class
StructuralMaterialTypeFilter Overload
Autodesk.Revit.DB.Structure Namespace